{"id":43,"date":"2024-06-16T09:54:12","date_gmt":"2024-06-16T09:54:12","guid":{"rendered":"https:\/\/asurascanslation.com\/?page_id=43"},"modified":"2024-06-16T09:54:12","modified_gmt":"2024-06-16T09:54:12","slug":"about-us","status":"publish","type":"page","link":"https:\/\/asurascanslation.com\/about-us\/","title":{"rendered":"About Us"},"content":{"rendered":"<p>Welcome to AsuraScans, your number-one source for all things manga. It’s a place where you can find high-quality manga online absolutely always free. We’re dedicated to providing you with the best of manga comics, and this website has been made specifically for all manga lovers who want to read all kinds of Manhua and even Manhwa. everything about manga.<\/p>\n<p>Our commitment is to provide high-quality content to people of all ages around the world. To share our passion and love for manga, through wonderful and meaningful stories for all her fans and our commitment to make it free for all.<\/p>\n<p>Asura Scans is a page for all Anime, Manga, Manhwa, Manhua, Gamer, and Cosplay fans. You can share all your anime-related memes, anime suggestions, reviews, manga suggestions, character fanfiction, favorite quotes, and just those everyday anime things that you love, especially those memes.<\/p>\n<p>This page is dedicated to all solo-levelon of anime fans from the basics to the Otaku elite, Even those anime trolls have a place they can fill here (within basic reasoning) Please just take a moment to go through our rules. Respect everyone. Note: We allow trolling so have fun, Just know the admin and mods have no chill.<\/p>\n<p>Do not advertise your page\/group. Refrain from re-posting pictures. Just don’t intentionally spam the page. Hate speech will not be tolerated when it comes to racism, religion, or gender. You WILL instantly be blocked, NO EXCEPTIONS. Note: If you don’t like the group, feel free to leave. The admins and Mods are also willing, I should say, very willing to teach you how to leave if in any case, you don’t know how to.<\/p>\n<p>No selfies unless you are cosplaying We give one warning only. If you have any questions about the group, ask the admins Most of all have fun and share your favorite anime links, pictures, descriptions, ships, cosplayers, etc. with us.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Welcome to AsuraScans, your number-one source for all things manga. It’s a place where you can find high-quality manga online absolutely always free. We’re dedicated to providing you with the&#8230;<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"footnotes":""},"class_list":["post-43","page","type-page","status-publish","hentry"],"_links":{"self":[{"href":"https:\/\/asurascanslation.com\/wp-json\/wp\/v2\/pages\/43"}],"collection":[{"href":"https:\/\/asurascanslation.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/asurascanslation.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/asurascanslation.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/asurascanslation.com\/wp-json\/wp\/v2\/comments?post=43"}],"version-history":[{"count":1,"href":"https:\/\/asurascanslation.com\/wp-json\/wp\/v2\/pages\/43\/revisions"}],"predecessor-version":[{"id":44,"href":"https:\/\/asurascanslation.com\/wp-json\/wp\/v2\/pages\/43\/revisions\/44"}],"wp:attachment":[{"href":"https:\/\/asurascanslation.com\/wp-json\/wp\/v2\/media?parent=43"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}